package ru.romanow

/**
 * Дана строка `s`, представляющая собой выражение, требуется вычислить это выражение и вернуть результат.
 * Строка `s` валидная и состоит из целых чисел и операций (`+`, `-`, `(`, `)`), разделенных пробельными символами.
 *
 * **Замечание**
 * * Целочисленное деление сокращается до нуля.
 * * Унарный минус может использоваться вместе с числом.
 * * Все результаты в диапазоне `[-2^31..2^31-1]`.
 * * Нельзя использовать функции `eval()` или подобные.
 *
 * [https://leetcode.com/problems/basic-calculator/](https://leetcode.com/problems/basic-calculator/)
 */
class BasicCalculatorWithBrackets {
    fun calculate(s: String): Int {
        return 0
    }
}
