package ru.romanow

/**
 * Дана закодированная строка, вернуть декодированную строку.
 *
 * Правила декодирования: запись `k[encoded_string]` означает, что `encoded_string` внутри квадратных скобок
 * повторяется `k` раз.
 *
 * **Замечание**
 * * Входная строка всегда действительна.
 * * Нет лишних пробелов, квадратные скобки имеют правильную форму и т. д.
 * * Кроме того, исходные данные не содержат никаких цифр и цифры предназначены только для повторяющихся чисел `k`.
 * * Например, не будет ввода типа `3a` или `2[4]`.
 *
 * [https://leetcode.com/problems/decode-string/](https://leetcode.com/problems/decode-string/)
 */
class DecodeString {
    fun decodeString(s: String): String {
        return s
    }
}
