package ru.romanow

/**
 * Дана строка `s`, изменить порядок слов на обратный.
 *
 * Слово определяется как последовательность символов, не являющихся пробелами.
 * Слова в `s` будут разделены хотя бы одним пробелом.
 *
 * Вернуть строку в обратном порядке, объединенную одним пробелом.
 *
 * **Замечание**
 * Строка `s` может содержать начальные или конечные пробелы, или несколько пробелов между двумя словами.
 * Возвращаемая строка должна содержать только один пробел, разделяющий слова.
 *
 * [https://leetcode.com/problems/reverse-words-in-a-string/](https://leetcode.com/problems/reverse-words-in-a-string/)
 */
class ReverseWordsInAString {
    fun reverseWords(s: String): String {
        return ""
    }
}
