package ru.romanow

/**
 * Требуется проверить корректность заполнения доски `9x9` для судоку.
 * Проверки подлежат только заполненные ячейки согласно следующим правилам:
 * * Каждая строка должна содержать цифры от 1 до 9 без повторений.
 * * Каждый столбец должен содержать цифры 1–9 без повторений.
 * * Каждый из девяти подполей сетки размером `3х3` должен содержать цифры от 1 до 9 без повторений.
 *
 * Примечание:
 * * Доска может быть допустимой, но не обязательно решаемой.
 * * Требуется проверять только заполненные ячейки.
 *
 * [https://leetcode.com/problems/valid-sudoku/](https://leetcode.com/problems/valid-sudoku/)
 */
class ValidSudoku {
    fun isValidSudoku(board: Array<CharArray>): Boolean {
        return false
    }
}
